app/views/public_activity/majorpost/_create.html.erb

				<!-- If there are images-->
				<% if activity.trackable.postimages.count > 0 %>
---
SELECT COUNT(*) FROM `postimages` WHERE `postimages`.`majorpost_id` = 5