app/views/public_activity/project/_create.html.erb

SELECT COUNT(*) FROM `projectimages` WHERE `projectimages`.`project_id` = 39
---
				<!-- If there are images-->
				<% if activity.trackable.projectimages.count > 0 %>