app/views/payments/_why.html.erb

SELECT `facebooks`.* FROM `facebooks` WHERE `facebooks`.`user_id` = 4 LIMIT 1
---
<% else %>
	<% if @user.facebookpages.first != nil  then %>