app/views/public_activity/comment/_create.html.erb

SELECT COUNT(*) FROM `commentimages` WHERE `commentimages`.`comment_id` = 2
---
				<!-- If there are images-->
				<% if activity.trackable.commentimages.count > 0 %>