app/controllers/amazon_controller.rb

SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`uuid` = 'd4a772cfe46f94439b61833851201618' ORDER BY subscriptions.created_at DESC LIMIT 1
INSERT INTO `activities` (`commented_at`, `created_at`, `deleted`, `deleted_at`, `draft`, `featured`, `key`, `owner_id`, `owner_type`, `parameters`, `realm`, `recipient_id`, `recipient_type`, `test`, `trackable_id`, `trackable_type`, `updated_at`) VALUES (NULL, '2014-04-20 20:34:53', 0, NULL, NULL, 0, 'subscription.create', 3, 'User', NULL, NULL, NULL, NULL, 0, 65, 'Subscription', '2014-04-20 20:34:53')
---
	def post_subscribe
		unless params[:callerReference].blank?
			@subscription = Subscription.find_by_uuid(params[:callerReference])
			@amazon_recurring = AmazonRecurring.postfill!(params)
		end
		#Add activity to the subscribed
		#SA 		Success status for the ABT payment method
		#SB 		Success status for the ACH (bank account) payment method
		#SC 		Success status for the credit card payment method
		if params['status'] == 'SA' || params['status'] == 'SB' || params['status'] == 'SC' then
			#Create Subscription

			@subscription.activated = true
			@subscription.activated_at = Time.now
			#Create activity
			#For subscribed
			@activity = PublicActivity::Activity.new
			@activity.trackable_id = @subscription.id
			@activity.trackable_type = "Subscription"
			@activity.owner_id = @subscription.subscribed.id
			@activity.owner_type = "User"
			@activity.key = "subscription.create"

SELECT `subscription_records`.* FROM `subscription_records` WHERE `subscription_records`.`subscriber_id` = 4 AND `subscription_records`.`subscribed_id` = 3 LIMIT 1
---
			@activity.save

			#Create Subscription Record
			@subscription_record = SubscriptionRecord.find_by_subscriber_id_and_subscribed_id(@subscription.subscriber_id,@subscription.subscribed_id)

UPDATE `subscriptions` SET `activated` = 1, `activated_at` = '2014-04-20 20:34:53', `subscription_record_id` = 4, `updated_at` = '2014-04-20 20:34:54' WHERE `subscriptions`.`id` = 65
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
				@subscription_record = SubscriptionRecord.new
				@subscription_record.subscriber_id = @subscription.subscriber_id
				@subscription_record.subscribed_id = @subscription.subscribed_id
				@subscription_record.save
			end

			#Add to User's Subscription amount
			@subscribed = User.find(@subscription.subscribed_id)