app/controllers/subscriptions_controller.rb

	def subscribers
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

	def subscribing
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

	def new
		@default = params[:default]
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

	def create
		@subscription = Subscription.new(params[:subscription])
		#See if it is a support
		if @subscription.amount == ENV["PRICE_1"].to_f
			@subscription.supporter_switch = true
		end
		@user = User.find(params[:id])
		@subscriber = User.find(@subscription.subscriber_id)
		@subscription.project_id = @user.projects.where(:published => true, :complete => false).first.id
		unless @user.subscribed_by?(@subscriber) || @subscriber.subscribed_by?(@user) then
			if @subscription.save
				@amazon_recurring = AmazonRecurring.prefill!(
					:subscription_id => @subscription.id,
					:transactionAmount => @subscription.amount.to_s,
					:recipientToken => @user.amazon_recipient.tokenID)
				@subscription.uuid = @amazon_recurring.uuid
				@subscription.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
INSERT INTO `subscriptions` (`accumulated_amazon`, `accumulated_ratafire`, `accumulated_receive`, `accumulated_total`, `activated`, `activated_at`, `amazon_valid`, `amount`, `created_at`, `deleted`, `deleted_at`, `deleted_reason`, `project_id`, `subscribed_id`, `subscriber_id`, `subscription_record_id`, `updated_at`, `uuid`) VALUES (0.0, 0.0, 0.0, 0.0, 0, NULL, 0, 27.03, '2014-04-20 20:34:40', 0, NULL, NULL, 44, 3, 4, NULL, '2014-04-20 20:34:40', NULL)
UPDATE `subscriptions` SET `uuid` = 'd4a772cfe46f94439b61833851201618', `updated_at` = '2014-04-20 20:34:40' WHERE `subscriptions`.`id` = 65
INSERT INTO `amazon_recurrings` (`addressLine1`, `addressLine2`, `addressName`, `callerReference`, `city`, `collectShippingAddress`, `country`, `created_at`, `currencyCode`, `errorMessage`, `id`, `isRecipientCobranding`, `paymentReason`, `phoneNumber`, `recipientToken`, `recurringPeriod`, `state`, `status`, `subscription_id`, `tokenID`, `transactionAmount`, `updated_at`, `uuid`, `validityExpiry`, `validityStart`, `warningCode`, `warningMessage`, `zip`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2014-04-20 20:34:40', NULL, NULL, NULL, NULL, NULL, NULL, 'K15GKX7UQUUHAS2DI22Q4FDZXG3DR4I62HU3M1DT1UFL7TI76LSFFOESRGD2MTBC', '1 month', NULL, NULL, 65, NULL, '27.03', '2014-04-20 20:34:40', 'd4a772cfe46f94439b61833851201618', NULL, NULL, NULL, NULL, NULL)

	def why
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

	def unsub
		@subscription = Subscription.find_by_subscriber_id_and_subscribed_id(params[:id],params[:subscribed_id])
		@user = User.find(@subscription.subscribed_id)
		@subscribed = @user
		@subscriber = User.find(@subscription.subscriber_id)
		#Cancel Amazon Payments Token
		response = AmazonFlexPay.cancel_token(@subscription.amazon_recurring.tokenID)
		@subscription.deleted_reason = 1
		@subscription.deleted = true
		@subscription.deleted_at = Time.now
		@subscription.next_transaction_queued = false
		@subscription.save
		#Mark Subscription Records as having pasts
		@subscription_record = SubscriptionRecord.find(@subscription.subscription_record_id)
		@subscription_record.past = true
		if @subscription_record.duration == nil then
			@subscription_record.duration = @subscription.deleted_at - @subscription.created_at
		else
			duration = @subscription.deleted_at - @subscription.created_at
			@subscription_record.duration = @subscription_record.duration + duration
		end
		@subscription_record.save
		#destroy activities as well if accumulated total is 0
		valid_subscription = ((@subscription.deleted_at - @subscription.created_at)/1.day).to_i
		if @subscription.accumulated_total == nil || @subscription.accumulated_total == 0 || valid_subscription < 30 then
			PublicActivity::Activity.find_all_by_trackable_id_and_trackable_type(@subscription.id,'Subscription').each do |activity|
				if activity != nil then
					activity.deleted = true
					activity.deleted_at = Time.now
					activity.save
---
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`subscriber_id` = 4 AND `subscriptions`.`subscribed_id` = 3 ORDER BY subscriptions.created_at DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `subscriptions` SET `deleted_reason` = 1, `deleted` = 1, `deleted_at` = '2014-04-20 20:34:15', `updated_at` = '2014-04-20 20:34:15' WHERE `subscriptions`.`id` = 64
UPDATE `users` SET `subscription_amount` = 17.0, `remember_token` = 'BYTkh8i3o0UgcvHuSwNGEg', `updated_at` = '2014-04-20 20:34:16' WHERE `users`.`id` = 3
SELECT `amazon_recurrings`.* FROM `amazon_recurrings` WHERE `amazon_recurrings`.`subscription_id` = 64 LIMIT 1
SELECT `subscription_records`.* FROM `subscription_records` WHERE `subscription_records`.`id` = 4 LIMIT 1
UPDATE `subscription_records` SET `duration` = 1158897.89591008507, `updated_at` = '2014-04-20 20:34:16' WHERE `subscription_records`.`id` = 4
SELECT `activities`.* FROM `activities` WHERE `activities`.`deleted` = 0 AND `activities`.`trackable_id` = 64 AND `activities`.`trackable_type` = 'Subscription'
UPDATE `activities` SET `deleted` = 1, `deleted_at` = '2014-04-20 20:34:16', `updated_at` = '2014-04-20 20:34:16', `parameters` = '--- {}\n' WHERE `activities`.`id` = 173