app/controllers/users_controller.rb

	def show
  		#Find user by username
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1