app/views/public_activity/project_comment/_create.html.erb

				<!-- If there are images-->
				<% if activity.trackable.commentimages.count > 0 %>
---
SELECT COUNT(*) FROM `commentimages` WHERE `commentimages`.`project_comment_id` = 3
SELECT `commentimages`.* FROM `commentimages` WHERE `commentimages`.`project_comment_id` = 6 LIMIT 1